v2206/validatioin_CHAD/RTIthermal/constant/transportProperties.leagacy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases
(
    lightFluid
    {
        transportModel Newtonian;
        nu             1e-06;
        rho            1000;
    }

    denseFluid
    {
        transportModel Newtonian;
        nu             1e-06;
        rho            1800;
    }
);

sigmas
(
    (lightFluid denseFluid) 0.07
);


// ************************************************************************* //
