v2206/validatioin_CHAD/RTIthermal/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir

runApplication blockMesh

runApplication setExprFields # setFields

runApplication decomposePar

runParallel $(getApplication)

runApplication reconstructPar

rm -rf processor*

runApplication foamToVTK

#------------------------------------------------------------------------------
